## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # azurerm_virtual_network.vn will be created
  + resource "azurerm_virtual_network" "vn" {
      + address_space       = [
          + "10.0.0.0/8",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "lorenzo-dev-vn"
      + resource_group_name = "Terraform-workshops"
      + subnet              = (known after apply)
    }

  # module.aks.data.azurerm_resource_group.rg-tfworkshops will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "rg-tfworkshops" {
      + id         = (known after apply)
      + location   = (known after apply)
      + managed_by = (known after apply)
      + name       = "Terraform-workshops"
      + tags       = (known after apply)
    }

  # module.aks.data.azurerm_virtual_network.vn will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_virtual_network" "vn" {
      + address_space           = (known after apply)
      + dns_servers             = (known after apply)
      + guid                    = (known after apply)
      + id                      = (known after apply)
      + location                = (known after apply)
      + name                    = "lorenzo-dev-vn"
      + resource_group_name     = "Terraform-workshops"
      + subnets                 = (known after apply)
      + tags                    = (known after apply)
      + vnet_peerings           = (known after apply)
      + vnet_peerings_addresses = (known after apply)
    }

  # module.aks.azurerm_kubernetes_cluster.aks will be created
  + resource "azurerm_kubernetes_cluster" "aks" {
      + current_kubernetes_version          = (known after apply)
      + dns_prefix                          = "lorenzo-dev"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = (known after apply)
      + location                            = "westeurope"
      + name                                = "lorenzo-dev-aks"
      + node_os_upgrade_channel             = "NodeImage"
      + node_resource_group                 = (known after apply)
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + resource_group_name                 = "Terraform-workshops"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Standard"
      + support_plan                        = "KubernetesOfficial"
      + workload_identity_enabled           = false

      + auto_scaler_profile (known after apply)

      + default_node_pool {
          + kubelet_disk_type    = (known after apply)
          + max_pods             = (known after apply)
          + name                 = "default"
          + node_count           = 3
          + node_labels          = (known after apply)
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = (known after apply)
          + os_disk_type         = "Managed"
          + os_sku               = (known after apply)
          + scale_down_mode      = "Delete"
          + type                 = "VirtualMachineScaleSets"
          + ultra_ssd_enabled    = false
          + vm_size              = "Standard_D2_v3"
          + vnet_subnet_id       = (known after apply)
          + workload_runtime     = (known after apply)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + kubelet_identity (known after apply)

      + network_profile (known after apply)

      + windows_profile (known after apply)
    }

  # module.aks.azurerm_subnet.nodepool-sn will be created
  + resource "azurerm_subnet" "nodepool-sn" {
      + address_prefixes                              = [
          + "10.1.0.0/16",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "nodepool-sn"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "Terraform-workshops"
      + virtual_network_name                          = "lorenzo-dev-vn"
    }

  # module.datahub.helm_release.datahub will be created
  + resource "helm_release" "datahub" {
      + atomic                     = false
      + chart                      = "datahub"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "datahub"
      + namespace                  = "default"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://helm.datahubproject.io/"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = (known after apply)
      + verify                     = false
      + version                    = "0.4.31"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.datahub.helm_release.datahub-prerequisites will be created
  + resource "helm_release" "datahub-prerequisites" {
      + atomic                     = false
      + chart                      = "datahub-prerequisites"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "prerequisites"
      + namespace                  = "default"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://helm.datahubproject.io/"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                # Default configuration for pre-requisites to get you started
                # Copy this file and update to the configuration of choice
                elasticsearch:
                  # set this to false, if you want to provide your own ES instance.
                  enabled: true
                
                  # If you're running in production, set this to 3 and comment out antiAffinity below
                  # Or alternatively if you're running production, bring your own ElasticSearch
                  replicas: 1
                  minimumMasterNodes: 1
                  # Set replicas to 1 and uncomment this to allow the instance to be scheduled on
                  # a master node when deploying on a single node Minikube / Kind / etc cluster.
                  antiAffinity: "soft"
                
                  # If you are running a multi-replica cluster, comment this out
                  clusterHealthCheckParams: "wait_for_status=yellow&timeout=1s"
                
                  # Shrink default JVM heap.
                  esJavaOpts: "-Xmx512m -Xms512m"
                
                  # Allocate smaller chunks of memory per pod.
                  resources:
                    requests:
                      cpu: "100m"
                      memory: "1024M"
                    limits:
                      cpu: "1000m"
                      memory: "1024M"
                
                  # Request smaller persistent volumes.
                  # volumeClaimTemplate:
                  #   accessModes: ["ReadWriteOnce"]
                  #   storageClassName: "standard"
                  #   resources:
                  #     requests:
                  #       storage: 100M
                
                opensearch:
                  enabled: false
                
                  # If you're running in production, set this to false, replicas to 3 and uncomment antiAffinity below
                  # Or alternatively if you're running production, bring your own OpenSearch
                  singleNode: true
                  # replicas: 3
                  # antiAffinity: "hard"
                
                  # By default security is enabled for OpenSearch, disable it here.
                  config:
                    opensearch.yml: |
                      plugins:
                        security:
                          disabled: true
                
                  extraEnvs:
                    - name: DISABLE_INSTALL_DEMO_CONFIG
                      value: "true"
                
                  image:
                    tag: "2.11.0"
                
                  # opensearchJavaOpts: "-Xmx512M -Xms512M"
                
                  # resources:
                  #   requests:
                  #     cpu: "1000m"
                  #     memory: "100Mi"
                
                  # Request smaller persistent volumes.
                  # persistence:
                  #   storageClass: "standard"
                  #   accessModes:
                  #     - ReadWriteOnce
                  #   size: 100M
                
                # Official neo4j chart, supports both community and enterprise editions
                # see https://neo4j.com/docs/operations-manual/current/kubernetes/ for more information
                # source: https://github.com/neo4j/helm-charts
                neo4j:
                  enabled: true
                  nameOverride: neo4j
                  neo4j:
                    name: neo4j
                    edition: "community"
                    acceptLicenseAgreement: "yes"
                    defaultDatabase: "graph.db"
                    # password: "datahub"
                    # For better security, add password to neo4j-secrets k8s secret with  neo4j-username neo4j-passwordn and NEO4J_AUTH and uncomment below
                    # NEO4J_AUTH: should be composed like so: {Username}/{Password}
                    passwordFromSecret: neo4j-secrets
                  services:
                    neo4j:
                      spec:
                        type: ClusterIP
                
                  # Set security context for pod
                  securityContext:
                    runAsNonRoot: true
                    runAsUser: 7474
                    runAsGroup: 7474
                    fsGroup: 7474
                    fsGroupChangePolicy: "Always"
                
                  # Disallow privilegeEscalation on container level
                  containerSecurityContext:
                    allowPrivilegeEscalation: false
                
                  # Create a volume for neo4j, SSD storage is recommended
                  volumes:
                    data:
                      mode: "defaultStorageClass"
                      # mode: "dynamic"
                      # dynamic:
                      #   storageClassName: managed-csi-premium
                
                  env:
                    NEO4J_PLUGINS: '["apoc"]'
                
                mysql:
                  enabled: false
                  image:
                    tag: 8.0.32-debian-11-r26
                  auth:
                    # For better security, add mysql-secrets k8s secret with mysql-root-password, mysql-replication-password and mysql-password
                    existingSecret: mysql-secrets
                  primary:
                    extraFlags: "--character-set-server=utf8mb4 --collation-server=utf8mb4_bin"
                
                postgresql:
                  enabled: false
                  auth:
                    # For better security, add postgresql-secrets k8s secret with postgres-password, replication-password and password
                    existingSecret: postgresql-secrets
                
                # Using gcloud-proxy requires the node in a GKE cluster to have Cloud SQL Admin scope,
                # you will need to create a new node and migrate the workload if your current node does not have this scope
                gcloud-sqlproxy:
                  enabled: false
                  # Specify an existing secret holding the cloud-sql service account credentials, if not specify,
                  # the default compute engine service account will be used and it needs to have Cloud SQL Client role
                  existingSecret: ""
                  # The key in the existing secret that stores the credentials
                  existingSecretKey: ""
                  ## the name of the ServiceAccount to be used
                  serviceAccountName: ""
                  # SQL connection settings
                  cloudsql:
                    # MySQL instances:
                    # update with your GCP project, the region of your Cloud SQL instance and the id of your Cloud SQL instance
                    # use port 3306 for MySQL, or other port you set for your SQL instance.
                    instances:
                      # GCP Cloud SQL instance id
                      - instance: ""
                        # GCP project where the instance exists.
                        project: ""
                        # GCP region where the instance exists.
                        region: ""
                        # Port number for the proxy to expose for this instance.
                        port: 3306
                
                cp-helm-charts:
                  enabled: true
                  # Schema registry is under the community license
                  cp-schema-registry:
                    enabled: false
                    kafka:
                      # <<release-name>>-kafka:9092
                      bootstrapServers: "prerequisites-kafka:9092"
                  cp-kafka:
                    enabled: false
                  cp-zookeeper:
                    enabled: false
                  cp-kafka-rest:
                    enabled: false
                  cp-kafka-connect:
                    enabled: false
                  cp-ksql-server:
                    enabled: false
                  cp-control-center:
                    enabled: false
                
                # Bitnami version of Kafka that deploys open source Kafka https://artifacthub.io/packages/helm/bitnami/kafka
                kafka:
                  enabled: true
                  listeners:
                    client:
                      protocol: PLAINTEXT
                    interbroker:
                      protocol: PLAINTEXT
                  controller:
                    replicaCount: 0
                  broker:
                    replicaCount: 1
                    # The new minId for broker is 100. If we don't override this, the broker will have id 100
                    # and cannot load the partitions. So we set minId to 0 to be backwards compatible
                    minId: 0
                    # These server properties are no longer exposed as parameters in the bitnami kafka chart since 24.0.0
                    # They need to be passed in through extraConfig. See below for reference
                    # https://github.com/bitnami/charts/tree/main/bitnami/kafka#to-2400
                    extraConfig: |
                      message.max.bytes=5242880
                      default.replication.factor=1
                      offsets.topic.replication.factor=1
                      transaction.state.log.replication.factor=1
                  kraft:
                    enabled: false
                  zookeeper:
                    enabled: true
            EOT,
        ]
      + verify                     = false
      + version                    = "0.1.13"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.datahub.kubernetes_secret.default-credentials will be created
  + resource "kubernetes_secret" "default-credentials" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + name             = "datahub-users-secret"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.datahub.kubernetes_secret.neo4j-secret will be created
  + resource "kubernetes_secret" "neo4j-secret" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + name             = "neo4j-secrets"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.datahub.kubernetes_secret.postgresql-secrets will be created
  + resource "kubernetes_secret" "postgresql-secrets" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + name             = "postgresql-secrets"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.postgres.data.azurerm_resource_group.rg-tfworkshops will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "rg-tfworkshops" {
      + id         = (known after apply)
      + location   = (known after apply)
      + managed_by = (known after apply)
      + name       = "Terraform-workshops"
      + tags       = (known after apply)
    }

  # module.postgres.data.azurerm_virtual_network.vn will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_virtual_network" "vn" {
      + address_space           = (known after apply)
      + dns_servers             = (known after apply)
      + guid                    = (known after apply)
      + id                      = (known after apply)
      + location                = (known after apply)
      + name                    = "lorenzo-dev-vn"
      + resource_group_name     = "Terraform-workshops"
      + subnets                 = (known after apply)
      + tags                    = (known after apply)
      + vnet_peerings           = (known after apply)
      + vnet_peerings_addresses = (known after apply)
    }

  # module.postgres.azurerm_postgresql_flexible_server.postgres will be created
  + resource "azurerm_postgresql_flexible_server" "postgres" {
      + administrator_login           = "psqladmin"
      + administrator_password        = (sensitive value)
      + auto_grow_enabled             = true
      + backup_retention_days         = (known after apply)
      + delegated_subnet_id           = (known after apply)
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "westeurope"
      + name                          = "lorenzo-dev-postgres"
      + private_dns_zone_id           = (known after apply)
      + public_network_access_enabled = false
      + resource_group_name           = "Terraform-workshops"
      + sku_name                      = "B_Standard_B1ms"
      + storage_mb                    = 32768
      + storage_tier                  = "P4"
      + version                       = "16"
      + zone                          = "1"

      + authentication (known after apply)
    }

  # module.postgres.azurerm_private_dns_zone.postgres-dns-zone will be created
  + resource "azurerm_private_dns_zone" "postgres-dns-zone" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "lorenzo.dev.postgres.database.azure.com"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "Terraform-workshops"

      + soa_record (known after apply)
    }

  # module.postgres.azurerm_private_dns_zone_virtual_network_link.postgres-dns-zone-link will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "postgres-dns-zone-link" {
      + id                    = (known after apply)
      + name                  = "lorenzo-dev-vnet-postgres-link"
      + private_dns_zone_name = "lorenzo.dev.postgres.database.azure.com"
      + registration_enabled  = false
      + resource_group_name   = "Terraform-workshops"
      + virtual_network_id    = (known after apply)
    }

  # module.postgres.azurerm_subnet.postgres-sn will be created
  + resource "azurerm_subnet" "postgres-sn" {
      + address_prefixes                              = [
          + "10.2.0.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "postgres-sn"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "Terraform-workshops"
      + service_endpoints                             = [
          + "Microsoft.Storage",
        ]
      + virtual_network_name                          = "lorenzo-dev-vn"

      + delegation {
          + name = "fs"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                ]
              + name    = "Microsoft.DBforPostgreSQL/flexibleServers"
            }
        }
    }

Plan: 12 to add, 0 to change, 0 to destroy.
```
</details>